platform: "tensorflow_savedmodel"
input [
    {
    name: "input_2"
    data_type: TYPE_FP32
    dims: [-1, -1, -1, 3]
    }
  ]

 output [
{
  name: "classes"
  data_type: TYPE_FP32
  dims: [-1, -1, 8]
},
{
  name: "boxes"
  data_type: TYPE_FP32
  dims: [-1, -1, 64]
}
]